In [140]:
import pandas as pd
import re
from datetime import date

In [156]:
df= pd.read_csv("Data/initial_Data(02-01-23).csv")

In [151]:
df.head()

,Price,Bedrooms,Bathrooms,Area,Location,date,id
0,"EGP 1,100,000",3,2,165 SQM,"Seyouf, Alexandria•",2023-01-26,194727255
1,"EGP 2,050,000",4,2,205 SQM,"Laurent, Alexandria•",2023-01-26,195269781
2,"EGP 1,150,000",2,1,110 SQM,"Sidi Beshr, Alexandria•",2023-01-26,195311167
3,"EGP 3,250,000",1,2,77 SQM,"Moharam Bik, Alexandria•",2023-01-26,195021040
4,"EGP 5,850,000",2,3,142 SQM,"Moharam Bik, Alexandria•",2023-01-26,195021675

In [143]:
df.describe()

          Bedrooms            id
count  5911.000000  5.911000e+03
mean      2.744882  1.943896e+08
std       0.738050  2.637094e+06
min       1.000000  1.452196e+08
25%       2.000000  1.944017e+08
50%       3.000000  1.948785e+08
75%       3.000000  1.953499e+08
max      10.000000  1.956657e+08

In [149]:
df["id"].nunique()

5866

In [152]:
ids = df["id"]
df[ids.isin(ids[ids.duplicated()])].sort_values("id")

,Price,Bedrooms,Bathrooms,Area,Location,date,id
819,"EGP 3,600,000",3,3,177 SQM,"Moharam Bik, Alexandria•",2023-01-25,193295058
38,"EGP 3,600,000",3,3,177 SQM,"Moharam Bik, Alexandria•",2023-01-26,193295058
37,"EGP 6,000,000",3,3,248 SQM,"Smoha, Alexandria•",2023-01-26,193648833
482,"EGP 6,000,000",3,3,248 SQM,"Smoha, Alexandria•",2023-01-29,193648833
737,"EGP 1,500,000",3,1,145 SQM,"Laurent, Alexandria•",2023-01-26,193765801
...,...,...,...,...,...,...,...
131,"EGP 3,200,000",3,2,200 SQM,"Smoha, Alexandria•",2023-02-01,195652801
56,"EGP 1,500,000",3,1,145 SQM,"Al Ibrahimiyyah, Alexandria•",2023-02-01,195663648
21,"EGP 1,500,000",3,1,145 SQM,"Al Ibrahimiyyah, Alexandria•",2023-01-26,195663648
7,"EGP 4,000,000",2,3,235 SQM,"Laurent, Alexandria•",2023-01-26,195664025
50,"EGP 4,000,000",2,3,235 SQM,"Laurent, Alexandria•",2023-02-01,195664025

In [153]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5911 entries, 0 to 5910
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      5911 non-null   object
 1   Bedrooms   5911 non-null   int64
 2   Bathrooms  5911 non-null   object
 3   Area       5911 non-null   object
 4   Location   5911 non-null   object
 5   date       5911 non-null   object
 6   id         5911 non-null   int64
dtypes: int64(2), object(5)
memory usage: 323.4+ KB

## Lets First  Remove strings from price, area, and bathrooms

In [157]:
df['Price'] = df["Price"].str.replace(r"[\D]",'',regex=True)
df['Price'] = df['Price'].astype(int)

df['Area'] = df["Area"].str.replace(r"[\D]",'',regex=True)
df['Area'] = df['Area'].astype(int)


df['Bathrooms'] = df["Bathrooms"].str.replace(r"[\D]",'',regex=True)
df['Bathrooms'] = df['Bathrooms'].astype(int)

In [148]:
df.head()

,Price,Bedrooms,Bathrooms,Area,Location,date,id
0,1100000,3,2,165,"Seyouf, Alexandria•",2023-01-26,194727255
1,2050000,4,2,205,"Laurent, Alexandria•",2023-01-26,195269781
2,1150000,2,1,110,"Sidi Beshr, Alexandria•",2023-01-26,195311167
3,3250000,1,2,77,"Moharam Bik, Alexandria•",2023-01-26,195021040
4,5850000,2,3,142,"Moharam Bik, Alexandria•",2023-01-26,195021675

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5911 entries, 0 to 5910
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      5911 non-null   int32
 1   Bedrooms   5911 non-null   int64
 2   Bathrooms  5911 non-null   int32
 3   Area       5911 non-null   int32
 4   Location   5911 non-null   object
 5   date       5911 non-null   object
 6   id         5911 non-null   int64
dtypes: int32(3), int64(2), object(2)
memory usage: 254.1+ KB

## Remove "Alexandria" and only keep the location

In [130]:
df.shape

(5911, 7)

In [131]:
df["Location"] = df["Location"].str.split(',').str[0]

In [132]:
type(df['Location'][0])

str

In [133]:
df.duplicated().sum()

9

In [105]:
mask = df.id.duplicated(keep=False)
df[mask].sort_values('id')

,Price,Bedrooms,Bathrooms,Area,Location,date,id
819,3600000,3,3,177,Moharam Bik,2023-01-25,193295058
38,3600000,3,3,177,Moharam Bik,2023-01-26,193295058
37,6000000,3,3,248,Smoha,2023-01-26,193648833
482,6000000,3,3,248,Smoha,2023-01-29,193648833
737,1500000,3,1,145,Laurent,2023-01-26,193765801
...,...,...,...,...,...,...,...
131,3200000,3,2,200,Smoha,2023-02-01,195652801
56,1500000,3,1,145,Al Ibrahimiyyah,2023-02-01,195663648
21,1500000,3,1,145,Al Ibrahimiyyah,2023-01-26,195663648
7,4000000,2,3,235,Laurent,2023-01-26,195664025
50,4000000,2,3,235,Laurent,2023-02-01,195664025

In [135]:
dropped= df.drop_duplicates(subset='id')

In [136]:
dropped.shape

(5866, 7)

In [137]:
dropped["id"].nunique()

5866

In [138]:
df['id'].size

5911

In [139]:
df['id'].size-df['id'].nunique()

45

In [74]:
df.head()

     Price  Bedrooms  Bathrooms  Area     Location        date         id
0  1100000         3          2   165       Seyouf  2023-01-26  194727255
1  2050000         4          2   205      Laurent  2023-01-26  195269781
2  1150000         2          1   110   Sidi Beshr  2023-01-26  195311167
3  3250000         1          2    77  Moharam Bik  2023-01-26  195021040
4  5850000         2          3   142  Moharam Bik  2023-01-26  195021675

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5911 entries, 0 to 5910
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      5911 non-null   int32
 1   Bedrooms   5911 non-null   int64
 2   Bathrooms  5911 non-null   int32
 3   Area       5911 non-null   int32
 4   Location   5911 non-null   object
 5   date       5911 non-null   object
 6   id         5911 non-null   int64
dtypes: int32(3), int64(2), object(2)
memory usage: 254.1+ KB

In [40]:
df["Location"].unique()

array(['Seyouf', 'Laurent', 'Sidi Beshr', 'Moharam Bik', 'Asafra',
       'Smoha', 'Zezenia', 'Miami', 'Roushdy', 'Kafr Abdo', 'Glim',
       'Bolkly', 'Sporting', 'Al Ibrahimiyyah', 'San Stefano',
       'Cleopatra', 'Saba Pasha', 'Gianaclis', 'Agami', 'Amreya',
       'Nakheel', 'Montazah', 'Raml Station', 'Bacchus', 'Victoria',
       'Attarin', 'Abu Talat', 'Mandara', 'Camp Caesar', 'Abu Qir',
       'Maamoura', 'Schutz', 'Stanley', 'Sidi Gaber', 'Dekheila',
       'Bahray - Anfoshy', 'Azarita', 'Fleming', 'Gomrok', 'Labban',
       'Borg al-Arab', 'Dhahria', 'Awayed', '•', 'Manshiyya', 'Al Hadrah',
       'Wardian', 'El Max', 'Salehia', 'Ras El Tin', 'Shatby',
       'Koum al-Dikka', 'Kabbary'], dtype=object)

# Lets replace "Laurent" with "Louran"

In [41]:
df["Location"] = df["Location"].str.replace('Laurent', "Louran")

In [42]:
df["Location"].unique()

array(['Seyouf', 'Louran', 'Sidi Beshr', 'Moharam Bik', 'Asafra', 'Smoha',
       'Zezenia', 'Miami', 'Roushdy', 'Kafr Abdo', 'Glim', 'Bolkly',
       'Sporting', 'Al Ibrahimiyyah', 'San Stefano', 'Cleopatra',
       'Saba Pasha', 'Gianaclis', 'Agami', 'Amreya', 'Nakheel',
       'Montazah', 'Raml Station', 'Bacchus', 'Victoria', 'Attarin',
       'Abu Talat', 'Mandara', 'Camp Caesar', 'Abu Qir', 'Maamoura',
       'Schutz', 'Stanley', 'Sidi Gaber', 'Dekheila', 'Bahray - Anfoshy',
       'Azarita', 'Fleming', 'Gomrok', 'Labban', 'Borg al-Arab',
       'Dhahria', 'Awayed', '•', 'Manshiyya', 'Al Hadrah', 'Wardian',
       'El Max', 'Salehia', 'Ras El Tin', 'Shatby', 'Koum al-Dikka',
       'Kabbary'], dtype=object)

In [43]:
df.head()

     Price  Bedrooms  Bathrooms  Area     Location        date         id
0  1100000         3          2   165       Seyouf  2023-01-26  194727255
1  2050000         4          2   205       Louran  2023-01-26  195269781
2  1150000         2          1   110   Sidi Beshr  2023-01-26  195311167
3  3250000         1          2    77  Moharam Bik  2023-01-26  195021040
4  5850000         2          3   142  Moharam Bik  2023-01-26  195021675

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5911 entries, 0 to 5910
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      5911 non-null   int32
 1   Bedrooms   5911 non-null   int64
 2   Bathrooms  5911 non-null   int32
 3   Area       5911 non-null   int32
 4   Location   5911 non-null   object
 5   date       5911 non-null   object
 6   id         5911 non-null   int64
dtypes: int32(3), int64(2), object(2)
memory usage: 254.1+ KB

# Finally, It's All Clean Lets now save it

In [24]:
today = date.today()
current_date = today.strftime("%m-%d-%y")
csv_name="clean_data({})".format(current_date)
print(csv_name)

clean_data(01-31-23)

In [25]:
df.to_csv("Data/"+csv_name+".csv",index=False)